// Задача №44
//Не используя рекурсию, выведите первые N чисел 
//Фибоначчи. Первые два числа Фибоначчи: 0 и 1.
//Например:
//Если N = 5 -> 0 1 1 2 3 
//Если N = 3 -> 0 1 1 
//Если N = 7 -> 0 1 1 2 3 5 8

//                                                Тело программы
//------------------------------------------------------------------------------------------------------------------
Console.Clear();
int n = ReadData("Введите количество чисел Фибоначчи (N): ");
PrintFibonacciNumbers(n);

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------
// Ввод числа с клавиатуры
int ReadData(string msg)
{
    Console.Write(msg);
    return int.Parse(Console.ReadLine() ?? "0");
}

// Метод печати чисел Фибоначчи
void PrintFibonacciNumbers(int n)
{
    int first = 0;
    int second = 1;
    int next = 0;

    for (int i = 0; i < n; i++)
    {
        Console.Write(first + " ");
        next = first + second;
        first = second;
        second = next;
    }
}
